Revit 2021.1 API
FabricationService.ResetServiceExclusionOverrides Method
 Resets the overridden service group and button exclusions back to default, as defined by the configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2017 Subscription Update
Syntax
C#
public void ResetServiceExclusionOverrides()
Visual Basic
Public Sub ResetServiceExclusionOverrides
Visual C++
public:
void ResetServiceExclusionOverrides()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace